import React, { Component } from "react";
import { Container, Accordion, Row } from "react-bootstrap";

class Services extends Component {
  render() {
    return (
      <Container fluid className="service" id="price">
        <Row>
          <h2 class="text-center text-uppercase pt-5 pb-5 aboutme">
            Мої Послуги
          </h2>
        </Row>
        <Accordion
          defaultActiveKey="0"
          className="acc_text d-flex flex-column align-items-center justify-content-center"
        >
          <Accordion.Item eventKey="0" className="col-6 shadow-lg mb-5">
            <Accordion.Header>
              Швидка онлайн-консультація – 399 грн
            </Accordion.Header>
            <Accordion.Body>
              <p>Що отримає клієнт:</p>
              <p>
                • Відповідь на одне конкретне питання, яке потребує швидкої
                поради.
              </p>
              <p>
                • Професійний аналіз ситуації з акцентом на вирішення нагальної
                проблеми.
              </p>
              <p>
                • Короткий практичний інструмент або рекомендація для
                першочергового кроку.
              </p>
            </Accordion.Body>
          </Accordion.Item>
          <Accordion.Item eventKey="1" className="col-6 shadow-lg mb-5">
            <Accordion.Header>
              Міні-діагностика Матриці Долі – 499 грн
            </Accordion.Header>
            <Accordion.Body>
              <p>Що отримає клієнт:</p>
              <p>
                • Основну інформацію про свою Матрицю Долі та базові енергетичні
                характеристики.
              </p>
              <p>• Аналіз сильних сторін і можливих життєвих напрямів.</p>
              <p>
                • Знайомство з потенціалом та ризиками, які можуть впливати на
                важливі сфери життя.
              </p>
              <p>
                • Рекомендацію щодо подальших кроків для глибшого вивчення свого
                шляху.
              </p>
            </Accordion.Body>
          </Accordion.Item>
          <Accordion.Item eventKey="2" className="col-6 shadow-lg mb-5">
            <Accordion.Header>
              Консультація з кармічного менеджменту – 799 грн
            </Accordion.Header>
            <Accordion.Body>
              <p>Що отримає клієнт:</p>
              <p>
                • Огляд основ кармічного менеджменту та його застосування для
                покращення фінансового стану.
              </p>
              <p>• Розуміння власних кармічних перешкод та як їх обійти.</p>
              <p>
                • Один-два базових інструменти для початку роботи над зміною
                фінансової енергії.
              </p>
              <p>
                • Інструкцію для самостійної практики, щоб поступово покращувати
                фінансове благополуччя.
              </p>
            </Accordion.Body>
          </Accordion.Item>
          <Accordion.Item eventKey="3" className="col-6 shadow-lg mb-5">
            <Accordion.Header>
              Консультація з аналізом певної життєвої сфери – 999 грн
            </Accordion.Header>
            <Accordion.Body>
              <p>Що отримає клієнт:</p>

              <p>Що ви отримаєте:</p>
              <p>
                • Годинна консультація з фокусом на одній життєвій сфері:
                фінанси, відносини, кар’єра або інша важлива тема.
              </p>
              <p>
                • Глибокий аналіз енергетичних блоків та сильних сторін у цій
                сфері.
              </p>
              <p>
                • Поради щодо використання сильних сторін для досягнення цілей.
              </p>
              <p>
                • Один-два рекомендаційних інструменти для вирішення конкретних
                питань або розвитку в цій сфері.
              </p>
            </Accordion.Body>
          </Accordion.Item>
          <Accordion.Item eventKey="4" className="col-6 shadow-lg mb-5">
            <Accordion.Header>
              Поглиблений аналіз Матриці Долі – 1299 грн
            </Accordion.Header>
            <Accordion.Body>
              <p>Що отримає клієнт:</p>

              <p>
                • Детальний аналіз Матриці Долі з акцентом на унікальні
                енергетичні характеристики.
              </p>
              <p>
                • Глибоке розуміння власного потенціалу, кармічних уроків та
                життєвих напрямків.
              </p>
              <p>
                • Індивідуальні поради щодо розвитку в особистих і професійних
                сферах.
              </p>
              <p>
                • Рекомендації для подальшої роботи над собою та створення
                гармонії в житті.
              </p>
            </Accordion.Body>
          </Accordion.Item>
          <Accordion.Item eventKey="5" className="col-6 shadow-lg mb-5">
            <Accordion.Header>
              Персональна програма кармічного менеджменту – 1999 грн
            </Accordion.Header>
            <Accordion.Body>
              <p>Що отримає клієнт:</p>
              <p>
                • Індивідуально розроблену програму для трансформації фінансової
                енергії та інших життєвих аспектів.
              </p>
              <p>
                • Інструменти кармічного менеджменту для покращення фінансового
                стану, відносин або духовного зростання.
              </p>
              <p>
                • Підтримку в формі періодичного супроводу та відповідей на
                запитання під час проходження програми.
              </p>
              <p>
                • План щоденних дій та практик, які можна виконувати самостійно
                для підтримки позитивних змін.
              </p>
            </Accordion.Body>
          </Accordion.Item>
          <Accordion.Item eventKey="6" className="col-6 shadow-lg mb-5">
            <Accordion.Header>
              Комплексна консультація + 2 супровідні сесії – 2500 грн
            </Accordion.Header>
            <Accordion.Body>
              <p>Що отримає клієнт:</p>
              <p>
                • Повний комплексний аналіз життєвих сфер із виявленням поточних
                блоків і сильних сторін.
              </p>
              <p>
                • Розробку персонального плану для досягнення бажаних змін у
                вибраній сфері.
              </p>
              <p>
                • Дві додаткові сесії для глибшого аналізу прогресу, адаптації
                програми та подальших рекомендацій
              </p>
              <p>
                • Інструкції для роботи з кармічними інструментами, що
                допоможуть подолати обмеження й досягти гармонії.
              </p>
            </Accordion.Body>
          </Accordion.Item>
        </Accordion>
      </Container>
    );
  }
}

export default Services;
